# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [5]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep="|")
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### [ ]Step 4. Discover what is the mean age per occupation

1. Mirar las columnas del dataframe:
    - age
    - occupation
2. Necesitamos una función que me agrupe según una columna.
3. ¿Cómo buscas esta función dentro? --> `shift + tab`
    1. Dentro del objeto
    2. Dentro de la librería
    3. Predefinida en el lenguaje de Python

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
type(df.groupby('occupation'))

pandas.core.groupby.generic.DataFrameGroupBy

In [13]:
dfg = df.groupby('occupation')

In [19]:
dfg.get_group('administrator')

     user_id  age gender     occupation zip_code
6          7   57      M  administrator    91344
7          8   36      M  administrator    05201
33        34   38      F  administrator    42141
41        42   30      M  administrator    17870
47        48   45      M  administrator    12550
..       ...  ...    ...            ...      ...
872      873   48      F  administrator    33763
878      879   33      F  administrator    55337
890      891   51      F  administrator    03062
921      922   29      F  administrator    21114
939      940   32      M  administrator    02215

[79 rows x 5 columns]

In [22]:
df.mean()

/var/folders/24/tg28vxls25l9mjvqrnh0plc80000gn/T/ipykernel_8005/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

user_id    472.000000
age         34.051962
dtype: float64

In [20]:
dfg.mean()

                  user_id        age
occupation
administrator  430.949367  38.746835
artist         451.892857  31.392857
doctor         533.714286  43.571429
educator       466.905263  42.010526
engineer       456.328358  36.388060
entertainment  398.000000  29.222222
executive      422.312500  38.718750
healthcare     501.437500  41.562500
homemaker      443.000000  32.571429
lawyer         359.083333  36.750000
librarian      486.588235  40.000000
marketing      437.807692  37.615385
none           368.666667  26.555556
other          542.733333  34.523810
programmer     435.530303  33.121212
retired        515.714286  63.071429
salesman       494.916667  35.666667
scientist      465.129032  35.548387
student        484.954082  22.081633
technician     497.629630  33.148148
writer         495.711111  36.311111

In [16]:
dfg.mean()

                  user_id        age
occupation
administrator  430.949367  38.746835
artist         451.892857  31.392857
doctor         533.714286  43.571429
educator       466.905263  42.010526
engineer       456.328358  36.388060
entertainment  398.000000  29.222222
executive      422.312500  38.718750
healthcare     501.437500  41.562500
homemaker      443.000000  32.571429
lawyer         359.083333  36.750000
librarian      486.588235  40.000000
marketing      437.807692  37.615385
none           368.666667  26.555556
other          542.733333  34.523810
programmer     435.530303  33.121212
retired        515.714286  63.071429
salesman       494.916667  35.666667
scientist      465.129032  35.548387
student        484.954082  22.081633
technician     497.629630  33.148148
writer         495.711111  36.311111

In [15]:
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [23]:
df[df.occupation == 'student']

     user_id  age gender occupation zip_code
8          9   29      M    student    01002
29        30    7      M    student    55436
31        32   28      F    student    78741
32        33   23      M    student    27510
35        36   19      F    student    93117
..       ...  ...    ...        ...      ...
927      928   21      M    student    55408
932      933   28      M    student    48105
938      939   26      F    student    33319
940      941   20      M    student    97229
942      943   22      M    student    77841

[196 rows x 5 columns]

In [24]:
df[df.occupation == 'administrator']

     user_id  age gender     occupation zip_code
6          7   57      M  administrator    91344
7          8   36      M  administrator    05201
33        34   38      F  administrator    42141
41        42   30      M  administrator    17870
47        48   45      M  administrator    12550
..       ...  ...    ...            ...      ...
872      873   48      F  administrator    33763
878      879   33      F  administrator    55337
890      891   51      F  administrator    03062
921      922   29      F  administrator    21114
939      940   32      M  administrator    02215

[79 rows x 5 columns]

In [6]:
df.age.mean()

# esto no es lo que quiere el enunciado, quiere la edad MEDIA por OCUPACIÓN, esto es la edad MEDIA de toda la columna de EDAD.
# Tenemos que AGRUPAR por categorías. O sea, aplicar la función groupby() sobre occupation

34.05196182396607

In [4]:
users.groupby(by='occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [16]:
# Para ponerlo en orden basta con aplicar la función sort_values(): 
# ¿Para ponerlo de mayor a menor?
users.groupby(by='occupation').age.mean().sort_values()

occupation
student          22.081633
none             26.555556
entertainment    29.222222
artist           31.392857
homemaker        32.571429
programmer       33.121212
technician       33.148148
other            34.523810
scientist        35.548387
salesman         35.666667
writer           36.311111
engineer         36.388060
lawyer           36.750000
marketing        37.615385
executive        38.718750
administrator    38.746835
librarian        40.000000
healthcare       41.562500
educator         42.010526
doctor           43.571429
retired          63.071429
Name: age, dtype: float64

### [ ]Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [26]:
df.groupby(['occupation', 'gender'])

In [27]:
df.groupby(['occupation', 'gender']).size()

occupation     gender
administrator  F          36
               M          43
artist         F          13
               M          15
doctor         M           7
educator       F          26
               M          69
engineer       F           2
               M          65
entertainment  F           2
               M          16
executive      F           3
               M          29
healthcare     F          11
               M           5
homemaker      F           6
               M           1
lawyer         F           2
               M          10
librarian      F          29
               M          22
marketing      F          10
               M          16
none           F           4
               M           5
other          F          36
               M          69
programmer     F           6
               M          60
retired        F           1
               M          13
salesman       F           3
               M           9
scientist      F           3
               M          28
student        F          60
               M         136
technician     F           1
               M          26
writer         F          19
               M          26
dtype: int64

In [28]:
gs = df.groupby(['occupation', 'gender']).size()

In [30]:
type(gs)

pandas.core.series.Series

In [35]:
gs.groupby('occupation')

In [37]:
gs.groupby('gender').apply(func=lambda x: x/x.sum())

occupation     gender
administrator  F         0.131868
               M         0.064179
artist         F         0.047619
               M         0.022388
doctor         M         0.010448
educator       F         0.095238
               M         0.102985
engineer       F         0.007326
               M         0.097015
entertainment  F         0.007326
               M         0.023881
executive      F         0.010989
               M         0.043284
healthcare     F         0.040293
               M         0.007463
homemaker      F         0.021978
               M         0.001493
lawyer         F         0.007326
               M         0.014925
librarian      F         0.106227
               M         0.032836
marketing      F         0.036630
               M         0.023881
none           F         0.014652
               M         0.007463
other          F         0.131868
               M         0.102985
programmer     F         0.021978
               M         0.089552
retired        F         0.003663
               M         0.019403
salesman       F         0.010989
               M         0.013433
scientist      F         0.010989
               M         0.041791
student        F         0.219780
               M         0.202985
technician     F         0.003663
               M         0.038806
writer         F         0.069597
               M         0.038806
dtype: float64

In [36]:
gs.groupby('occupation').apply(func=lambda x: x/x.sum())

occupation     gender
administrator  F         0.455696
               M         0.544304
artist         F         0.464286
               M         0.535714
doctor         M         1.000000
educator       F         0.273684
               M         0.726316
engineer       F         0.029851
               M         0.970149
entertainment  F         0.111111
               M         0.888889
executive      F         0.093750
               M         0.906250
healthcare     F         0.687500
               M         0.312500
homemaker      F         0.857143
               M         0.142857
lawyer         F         0.166667
               M         0.833333
librarian      F         0.568627
               M         0.431373
marketing      F         0.384615
               M         0.615385
none           F         0.444444
               M         0.555556
other          F         0.342857
               M         0.657143
programmer     F         0.090909
               M         0.909091
retired        F         0.071429
               M         0.928571
salesman       F         0.250000
               M         0.750000
scientist      F         0.096774
               M         0.903226
student        F         0.306122
               M         0.693878
technician     F         0.037037
               M         0.962963
writer         F         0.422222
               M         0.577778
dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [ ]:
df.groupby('occupation').age.agg(['min', 'max'])

In [26]:
# aunque ya en el step 4 puedes obtener la respuesta, se puede escribir un código que te devuelve el mínimo y el máximo
# por cada empleo, la función que ayuda a averiguarlo es la de agg()

users.groupby('occupation').age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [39]:
res = df.groupby(['occupation', 'gender']).age.mean()

In [47]:
res.sort_index(level='gender')

occupation     gender
administrator  F         40.638889
artist         F         30.307692
educator       F         39.115385
engineer       F         29.500000
entertainment  F         31.000000
executive      F         44.000000
healthcare     F         39.818182
homemaker      F         34.166667
lawyer         F         39.500000
librarian      F         40.000000
marketing      F         37.200000
none           F         36.500000
other          F         35.472222
programmer     F         32.166667
retired        F         70.000000
salesman       F         27.000000
scientist      F         28.333333
student        F         20.750000
technician     F         38.000000
writer         F         37.631579
administrator  M         37.162791
artist         M         32.333333
doctor         M         43.571429
educator       M         43.101449
engineer       M         36.600000
entertainment  M         29.000000
executive      M         38.172414
healthcare     M         45.400000
homemaker      M         23.000000
lawyer         M         36.200000
librarian      M         40.000000
marketing      M         37.875000
none           M         18.600000
other          M         34.028986
programmer     M         33.216667
retired        M         62.538462
salesman       M         38.555556
scientist      M         36.321429
student        M         22.669118
technician     M         32.961538
writer         M         35.346154
Name: age, dtype: float64

In [45]:
res.sort_values()

occupation     gender
none           M         18.600000
student        F         20.750000
               M         22.669118
homemaker      M         23.000000
salesman       F         27.000000
scientist      F         28.333333
entertainment  M         29.000000
engineer       F         29.500000
artist         F         30.307692
entertainment  F         31.000000
programmer     F         32.166667
artist         M         32.333333
technician     M         32.961538
programmer     M         33.216667
other          M         34.028986
homemaker      F         34.166667
writer         M         35.346154
other          F         35.472222
lawyer         M         36.200000
scientist      M         36.321429
none           F         36.500000
engineer       M         36.600000
administrator  M         37.162791
marketing      F         37.200000
writer         F         37.631579
marketing      M         37.875000
technician     F         38.000000
executive      M         38.172414
salesman       M         38.555556
educator       F         39.115385
lawyer         F         39.500000
healthcare     F         39.818182
librarian      M         40.000000
               F         40.000000
administrator  F         40.638889
educator       M         43.101449
doctor         M         43.571429
executive      F         44.000000
healthcare     M         45.400000
retired        M         62.538462
               F         70.000000
Name: age, dtype: float64

In [43]:
res.index

MultiIndex([('administrator', 'F'),
            ('administrator', 'M'),
            (       'artist', 'F'),
            (       'artist', 'M'),
            (       'doctor', 'M'),
            (     'educator', 'F'),
            (     'educator', 'M'),
            (     'engineer', 'F'),
            (     'engineer', 'M'),
            ('entertainment', 'F'),
            ('entertainment', 'M'),
            (    'executive', 'F'),
            (    'executive', 'M'),
            (   'healthcare', 'F'),
            (   'healthcare', 'M'),
            (    'homemaker', 'F'),
            (    'homemaker', 'M'),
            (       'lawyer', 'F'),
            (       'lawyer', 'M'),
            (    'librarian', 'F'),
            (    'librarian', 'M'),
            (    'marketing', 'F'),
            (    'marketing', 'M'),
            (         'none', 'F'),
            (         'none', 'M'),
            (        'other', 'F'),
            (        'other', 'M'),
            (   'programmer', 'F'),
            (   'programmer', 'M'),
            (      'retired', 'F'),
            (      'retired', 'M'),
            (     'salesman', 'F'),
            (     'salesman', 'M'),
            (    'scientist', 'F'),
            (    'scientist', 'M'),
            (      'student', 'F'),
            (      'student', 'M'),
            (   'technician', 'F'),
            (   'technician', 'M'),
            (       'writer', 'F'),
            (       'writer', 'M')],
           names=['occupation', 'gender'])

In [41]:
res.values

array([40.63888889, 37.1627907 , 30.30769231, 32.33333333, 43.57142857,
       39.11538462, 43.10144928, 29.5       , 36.6       , 31.        ,
       29.        , 44.        , 38.17241379, 39.81818182, 45.4       ,
       34.16666667, 23.        , 39.5       , 36.2       , 40.        ,
       40.        , 37.2       , 37.875     , 36.5       , 18.6       ,
       35.47222222, 34.02898551, 32.16666667, 33.21666667, 70.        ,
       62.53846154, 27.        , 38.55555556, 28.33333333, 36.32142857,
       20.75      , 22.66911765, 38.        , 32.96153846, 37.63157895,
       35.34615385])

In [29]:
# Igual que en el step 4, pero le metes el sexo y lo encorchetas

users.groupby(['occupation', 'gender']).age.mean().sort_values()

occupation     gender
none           M         18.600000
student        F         20.750000
               M         22.669118
homemaker      M         23.000000
salesman       F         27.000000
scientist      F         28.333333
entertainment  M         29.000000
engineer       F         29.500000
artist         F         30.307692
entertainment  F         31.000000
programmer     F         32.166667
artist         M         32.333333
technician     M         32.961538
programmer     M         33.216667
other          M         34.028986
homemaker      F         34.166667
writer         M         35.346154
other          F         35.472222
lawyer         M         36.200000
scientist      M         36.321429
none           F         36.500000
engineer       M         36.600000
administrator  M         37.162791
marketing      F         37.200000
writer         F         37.631579
marketing      M         37.875000
technician     F         38.000000
executive      M         38.172414
salesman       M         38.555556
educator       F         39.115385
lawyer         F         39.500000
healthcare     F         39.818182
librarian      M         40.000000
               F         40.000000
administrator  F         40.638889
educator       M         43.101449
doctor         M         43.571429
executive      F         44.000000
healthcare     M         45.400000
retired        M         62.538462
               F         70.000000
Name: age, dtype: float64

### [ ]Step 8.  For each occupation present the percentage of women and men